Ran Plan for 6 projects:

1. dir: `infra/us-east-1/mgmt/atlantis/alb` workspace: `default`
1. dir: `infra/us-east-1/mgmt/atlantis/ecr` workspace: `default`
1. dir: `infra/us-east-1/mgmt/atlantis/key-pair` workspace: `default`
1. dir: `infra/us-east-1/mgmt/atlantis/acm` workspace: `default`
1. dir: `infra/us-east-1/mgmt/atlantis/ec2` workspace: `default`
1. dir: `infra/us-east-1/mgmt/atlantis/security-group` workspace: `default`

### 1. dir: `infra/us-east-1/mgmt/atlantis/alb` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "terragrunt plan -input=false $(eval echo ${COMMENT_ARGS}) -out=${PLANFILE}" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/121/default/infra/us-east-1/mgmt/atlantis/alb": exit status 1: running "terragrunt plan -input=false $(eval echo ${COMMENT_ARGS}) -out=${PLANFILE}" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/121/default/infra/us-east-1/mgmt/atlantis/alb": 
time=2024-01-18T10:44:36Z level=warning msg=No double-slash (//) found in source URL /terraform-aws-modules/terraform-aws-acm.git. Relative paths in downloaded Terraform code may not work. prefix=[/atlantis-data/repos/input-output-hk/sc-dev-platform/121/default/infra/us-east-1/mgmt/atlantis/acm] 
time=2024-01-18T10:44:36Z level=warning msg=No double-slash (//) found in source URL /terraform-aws-modules/terraform-aws-ec2-instance.git. Relative paths in downloaded Terraform code may not work. prefix=[/atlantis-data/repos/input-output-hk/sc-dev-platform/121/default/infra/us-east-1/mgmt/atlantis/ec2] 
time=2024-01-18T10:44:36Z level=warning msg=No double-slash (//) found in source URL /terraform-aws-modules/terraform-aws-vpc.git. Relative paths in downloaded Terraform code may not work. prefix=[/atlantis-data/repos/input-output-hk/sc-dev-platform/121/default/infra/us-east-1/mgmt/vpc] 
time=2024-01-18T10:46:19Z level=warning msg=No double-slash (//) found in source URL /terraform-aws-modules/terraform-aws-alb.git. Relative paths in downloaded Terraform code may not work.

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/aws versions matching ">= 5.31.0"...
- Installing hashicorp/aws v5.32.1...
╷
│ Error: Failed to install provider
│ 
│ Error while installing hashicorp/aws v5.32.1: releases.hashicorp.com: Get
│ "https://releases.hashicorp.com/terraform-provider-aws/5.32.1/terraform-provider-aws_5.32.1_linux_amd64.zip":
│ read tcp 10.50.73.41:44446->99.86.229.53:443: read: connection reset by
│ peer
╵

time=2024-01-18T10:46:22Z level=error msg=Terraform invocation failed in /atlantis-data/repos/input-output-hk/sc-dev-platform/121/default/infra/us-east-1/mgmt/atlantis/alb/.terragrunt-cache/K38V0OWn6tVZKz3hJaFgTUJY6yU/pFKqczSYgLvmEDSOXj1dnhGgGS4 prefix=[/atlantis-data/repos/input-output-hk/sc-dev-platform/121/default/infra/us-east-1/mgmt/atlantis/alb] 
time=2024-01-18T10:46:22Z level=error msg=1 error occurred:
	* [/atlantis-data/repos/input-output-hk/sc-dev-platform/121/default/infra/us-east-1/mgmt/atlantis/alb/.terragrunt-cache/K38V0OWn6tVZKz3hJaFgTUJY6yU/pFKqczSYgLvmEDSOXj1dnhGgGS4] exit status 1




```
</details>

---
### 2. dir: `infra/us-east-1/mgmt/atlantis/ecr` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2024-01-18T10:44:35Z level=warning msg=No double-slash (//) found in source URL /terraform-aws-modules/terraform-aws-ecr.git. Relative paths in downloaded Terraform code may not work.

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/aws versions matching ">= 4.22.0"...
- Installing hashicorp/aws v5.32.1...
- Installed hashicorp/aws v5.32.1 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!
data.aws_partition.current: Reading...
data.aws_caller_identity.current: Reading...
data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_caller_identity.current: Read complete after 0s [id=677160962006]
data.aws_iam_policy_document.repository[0]: Reading...
data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=3792795651]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.this[0] will be created
+   resource "aws_ecr_lifecycle_policy" "this" {
+       id          = (known after apply)
+       policy      = jsonencode(
            {
+               rules = [
+                   {
+                       action       = {
+                           type = "expire"
                        }
+                       description  = "keep last 20 images"
+                       rulePriority = 10
+                       selection    = {
+                           countNumber = 20
+                           countType   = "imageCountMoreThan"
+                           tagStatus   = "any"
                        }
                    },
+                   {
+                       action       = {
+                           type = "expire"
                        }
+                       description  = "Expire untagged images older than 14 days"
+                       rulePriority = 1
+                       selection    = {
+                           countNumber = 1
+                           countType   = "sinceImagePushed"
+                           countUnit   = "days"
+                           tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
+       registry_id = (known after apply)
+       repository  = "scde"
    }

  # aws_ecr_repository.this[0] will be created
+   resource "aws_ecr_repository" "this" {
+       arn                  = (known after apply)
+       id                   = (known after apply)
+       image_tag_mutability = "IMMUTABLE"
+       name                 = "scde"
+       registry_id          = (known after apply)
+       repository_url       = (known after apply)
+       tags_all             = {
+           "Environment"  = "mgmt"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }

+       encryption_configuration {
+           encryption_type = "AES256"
+           kms_key         = (known after apply)
        }

+       image_scanning_configuration {
+           scan_on_push = true
        }
    }

  # aws_ecr_repository_policy.this[0] will be created
+   resource "aws_ecr_repository_policy" "this" {
+       id          = (known after apply)
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = [
+                           "ecr:ListTagsForResource",
+                           "ecr:ListImages",
+                           "ecr:GetRepositoryPolicy",
+                           "ecr:GetLifecyclePolicyPreview",
+                           "ecr:GetLifecyclePolicy",
+                           "ecr:GetDownloadUrlForLayer",
+                           "ecr:GetAuthorizationToken",
+                           "ecr:DescribeRepositories",
+                           "ecr:DescribeImages",
+                           "ecr:DescribeImageScanFindings",
+                           "ecr:BatchGetImage",
+                           "ecr:BatchCheckLayerAvailability",
                        ]
+                       Effect    = "Allow"
+                       Principal = {
+                           AWS = "arn:aws:iam::677160962006:root"
                        }
+                       Sid       = "PrivateReadOnly"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       registry_id = (known after apply)
+       repository  = "scde"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   repository_arn         = (known after apply)
+   repository_registry_id = (known after apply)
+   repository_url         = (known after apply)
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/mgmt/atlantis/ecr`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fmgmt%252Fatlantis%252Fecr%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/mgmt/atlantis/ecr`
</details>
Plan: 3 to add, 0 to change, 0 to destroy.

---
### 3. dir: `infra/us-east-1/mgmt/atlantis/key-pair` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/mgmt/atlantis/key-pair`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fmgmt%252Fatlantis%252Fkey-pair%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/mgmt/atlantis/key-pair`

---
### 4. dir: `infra/us-east-1/mgmt/atlantis/acm` workspace: `default`
<details><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_acm_certificate.this[0] has changed
!   resource "aws_acm_certificate" "this" {
        id                        = "arn:aws:acm:us-east-1:677160962006:certificate/b360289d-9c8d-441c-877b-d56f20fbc339"
!       status                    = "PENDING_VALIDATION" -> "ISSUED"
        tags                      = {
            "Environment" = "mgmt"
            "Name"        = "atlantis-acm"
            "Project"     = "scde"
            "Tribe"       = "smartcontracts"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Changes to Outputs:
!   acm_certificate_status                    = "PENDING_VALIDATION" -> "ISSUED"

You can apply this plan to save these new output values to the Terraform
state, without changing any real infrastructure.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/mgmt/atlantis/acm`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fmgmt%252Fatlantis%252Facm%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/mgmt/atlantis/acm`
</details>

**Note: Objects have changed outside of Terraform**

---
### 5. dir: `infra/us-east-1/mgmt/atlantis/ec2` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/mgmt/atlantis/ec2`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fmgmt%252Fatlantis%252Fec2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/mgmt/atlantis/ec2`

---
### 6. dir: `infra/us-east-1/mgmt/atlantis/security-group` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/mgmt/atlantis/security-group`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fmgmt%252Fatlantis%252Fsecurity-group%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/mgmt/atlantis/security-group`

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`